bearxiong99/SmartCityLighting/Firmware/src/ti/source/ti/devices/cc26x0r2/inc/hw_rfc_dbell.h
// Field:   [3:0] GPOCTL0
//
// RF Core GPO control bit 0. Selects which signal to output on the RF Core GPO
// line 0.
// ENUMs:
// RATGPO3                  RAT GPO line 3
// RATGPO2                  RAT GPO line 2
// RATGPO1                  RAT GPO line 1
// RATGPO0                  RAT GPO line 0
// RFEGPO3                  RFE GPO line 3
// RFEGPO2                  RFE GPO line 2
// RFEGPO1                  RFE GPO line 1
// RFEGPO0                  RFE GPO line 0
// MCEGPO3                  MCE GPO line 3
// MCEGPO2                  MCE GPO line 2
// MCEGPO1                  MCE GPO line 1
// MCEGPO0                  MCE GPO line 0
// CPEGPO3                  CPE GPO line 3
// CPEGPO2                  CPE GPO line 2
// CPEGPO1                  CPE GPO line 1
// CPEGPO0                  CPE GPO line 0
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_W                                        4
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_M                               0x0000000F
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_S                                        0
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO3                         0x0000000F
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO2                         0x0000000E
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO1                         0x0000000D
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO0                         0x0000000C
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO3                         0x0000000B
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO2                         0x0000000A
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO1                         0x00000009
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO0                         0x00000008
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO3                         0x00000007
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO2                         0x00000006
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO1                         0x00000005
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO0                         0x00000004
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO3                         0x00000003
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO2                         0x00000002
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO1                         0x00000001
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO0                         0x00000000


#endif // __RFC_DBELL__
